# Списки

Список (list) -- это объединение нескольких переменных под одним именем. Чтобы завести список, надо перечислить значения его элементов в квадратных скобках:

    a = [1,2,'три',False,5]

Чтобы обратиться к элементу списка, надо после имени списка указать в квадратных скобках номер (индекс) элемента. Например так мы узнаем значение элемента номер 2 списка ```a```, а затем весь список:

    print(a[2])
    print(a)

Нумерация элементов начинается с нуля. То есть ```a[0]``` -- это первый элементы списка, ```a[1]``` -- второй, ```a[2]``` -- третий, и так далее. Кроме того в питоне можно легко обратиться к последнему элементу списка по индексу -1, а к предпоследнему по индексу -2 и так далее:

    print(a[-1])
    print(a[-2])

Списки можно соединять с помощью плюса:

    b = a + ['шесть',True,'восемь']
    print(b)
    print(b[4])
    print(b[7])
    print(b[-1])


# Строки как списки

Строки -- это почти то же самое, что и списки. Их элементами являются строки из одного символа:

    s = 'абвгд'
    print(s)
    print(s[2])
    print(s[-2])
    t = s + 'еёжз'
    print(t)
    print(t[8])


# Цикл ```for```

Цикл ```for``` позволяет произвести какие-то операции со всеми элементами некоторого списка. Например, выведем на экран их квадраты (квадратом называется произведение числа с самим собой):

    for x in [1,2,3,4,5]:
        print(x*x)

*For* в переводе на русский означает *для*. Поэтому текст программы можно перевести как

    для каждого элемента x из списка [1,2,3,4,5] сделай следующее:
        выведи на экран (x умножить на x)

Обратите внимание, как пишется цикл: два ключевых слова ```for``` и ```in```, в конце строки *двоеточие*, а потом тело цикла пишется с *отступом*. По отступу компьютер понимает, где заканчивается цикл.

В качестве списка может выступать и строка. Например в следующей программе цикл проходит по всем буквам слова *строка* и присоединяет их к изначально пустой строке ```st```, причем делает это слева. В результате получаетс строка, развернутая наоборот:

    st = ''
    for x in 'строка':
        st = x + st
    print(st)

**Задача.** Напишите программу разворачавающую строку, полученную от пользователем с помощью функции ```input```.

**Задача.** Напишите программу проверающую, является ли введенная пользователем строка палиндромом (то есть чистается ли она одинаково и слева-направо и справа-налево).


# Функции ```ord``` и ```chr```
 
Это функции для работы с символами. Существует таблица символов Unicode, в которой собраны буквы почти всех языков и огромное число разных других символов. Каждый символ имеет в ней какой-то номер. Узнать его можно функцией ```ord```:

    print(ord('F'))
    print(ord('Ө'))
    print(ord('学'))

Наоборот получить символ по его номеру можно с помощью функции ```chr```:

    print(chr(23398))

Напишем программу, которая шифрует введеный пользователем текст, заменяя все буквы в нем на следующие за ними в таблице Unicode:

    s1 = input()
    s2 = ''
    for x in s1:
        s2 = s2 + chr(ord(x)+1)
    print(s2)

**Задача.** Напишите программу, которая расшифровывает текст, зашифрованный предыдущей программой.

**Задача.** Расшифруйте предложение ```Тцпмыст0$жя$хуфджмпмхѐ%$Рткйцй$уйфйщтимцѐ$идпѐьй2```.


# Функция ```range```

Эта функция создает список из первых натуральных чисел начиная с нуля. Количество чисел равно переданному функции аргументу. То есть, если передать аргумент ```n```, мы получим числа от ```0``` до ```n-1```.

    print('Квадраты целых чисел от 0 до 20:')
    for x in range(21):
        print(' квадрат числа',x,'равен',x*x)

    print('Первые 500 символов Unicode:')
    for i in range(500):
        print('Символ номер',i,'-',chr(i))

Посчитаем с помощью этой функции сумму чисел от 1 до 100:

    sum = 0
    for x in range(101):
        sum = sum + x
    print(sum)

Обратите внимание: аргумент функции ```range``` равен 101, чтобы последнее прибавляемое число было 100. Последняя строка написана без отступа, поэтому она выполняется всего один раз после того как цикл завершится. Первое прибавляемое число -- это ноль, это никак не влияет на результат.

Давайте посчитаем произведение целых чисел от 1 до 100. Но теперь первое число ноль обнулит нам весь результат. Чтобы его не было, можно вызвать функцию ```range``` с двумя аргументами, вот так ```range(a,b)``` -- это даст нам список всех целых чисел от a включительно до b не включительно:

    prod = 0
    for x in range(1,101):
        prod = prod * x
    print(prod)

Если добавить в ```range``` третий аргумент, то она вернет нам не все подряд числа, а с указанным шагом. Например, выведем на экран каждый сотый символ Unicode:

    for i in range(0,55200,100):
        print(i,chr(i))

**Задача.** Напишите программу, которая выдает произведение натуральных чисел от 1 до n, где число n вводит пользователь.

**Задача.** Найдите сумму квадратов целых чисел от 1 до 100.

**Задача.** Найдите сумму обратных квадратов целых чисел от 1 до 10000, то есть сумму $1+\tfrac{1}{4}+\tfrac{1}{9}+\tfrac{1}{16}+\ldots$
